apple-open-source/macos/IOUSBFamily/AppleUSBUHCI/Classes/AppleUSBUHCI.cpp
	//for frame rolloever interrupt
	
	//1) allocate rollover TDs
	//allocate a dummy QH and TD for the rollover interrupt.
	//a dummy TD is linked directly into the schedule, the QH is not.  The QH is only used to allocate the dummy TD here.
	
	USBLog(5, "AppleUSBUHCI[%p]::Allocate rollover QH,TD",  this);
	//for the rollover QH:
	//function,enpoint,direction,speed,maxpacket all set to zero
	rolloverQH = AllocateQH(0, 0, 0, 0, 0, kQHTypeDummy);
	if (rolloverQH == NULL)
        return kIOReturnNoMemory;

	rolloverTD = AllocateTD(rolloverQH);
	if (rolloverTD == NULL)
        return kIOReturnNoMemory;

	//2) init the rollover TD
	//init additional rolloverTD fields, we must set the following to make the HC to generate an interrupt:
	//Active bit is set to (0).
	//InterruptOnComplete bit set to (1).
	//Buffer Pointer set to arbitary sig value 0xdeadbeef.
	rolloverTD->GetSharedLogical()->ctrlStatus |= kUHCI_TD_IOC;
	rolloverTD->GetSharedLogical()->buffer = 0xdeadbeef;
	
	//3) link the rollover TD to the schedule
	//Hardware Link Pointer, points to the 32ms interrupt queue head at index [0] in the frame list.
	//QHTDselect set to 1 (QH) because we link the TD to a static queue head.
	thing = _logicalFrameList[kUHCI_ROLLOVERFRAME];	  

	link32msQH = HostToUSBLong(thing->GetPhysicalAddrWithType());
	rolloverTD->GetSharedLogical()->link = link32msQH;
	// linked in to schedule now -- controller should not running but if is it can 
	// access the rollover TD at this point.
	_frameList[kUHCI_ROLLOVERFRAME] = HostToUSBLong(rolloverTD->GetPhysicalAddrWithType());
	
	_logicalFrameList[kUHCI_ROLLOVERFRAME] = rolloverTD;

	// remeber these for debugging
	_rolloverQH = rolloverQH;
	_rolloverTD = rolloverTD;
	USBLog(5, "AppleUSBUHCI[%p]::Allocate rollover QH,TD (success)",  this);
#undef  kUHCI_ROLLOVERFRAME

    // For "bandwidth reclamation", point the hardware link
	//	for the last QH back to the full speed queue head.
	//	Don't link the software pointer.
	//
    _lastQH->SetPhysicalLink(fsQH->GetPhysicalAddrWithType() | kUHCI_QH_T);					// start with a terminated list

	// Use 64-byte packets, and mark controller as configured
	Command(kUHCI_CMD_MAXP | kUHCI_CMD_CF);
	USBLog(7, "AppleUSBUHCI[%p]::HardwareInit - Command register reports %x", this, ioRead16(kUHCI_CMD));
	
	return kIOReturnSuccess;
	
#if 0
	// with the new power management changes, leave the controller not running, and leave the interrupts disabled
	// until the setPowerState comes in
	
	// Enable interrupts
	ioWrite16(kUHCI_INTR, kUHCI_INTR_TIE | kUHCI_INTR_RIE | kUHCI_INTR_IOCE | kUHCI_INTR_SPIE);
	USBLog(2, "AppleUSBUHCI[%p]::HardwareInit - Interrupt register reports %x", this, ioRead16(kUHCI_INTR));

	// Start the controller
	return Run(true);
#endif

}



IOReturn
AppleUSBUHCI::UIMInitialize(IOService * provider)
{
    IOReturn		status;
	int				i;
	uint64_t		tempTime;
    
    USBLog(7, "+AppleUSBUHCI[%p]::UIMInitialize", this);
    
    if (!_uimInitialized) 
	{
        _device = OSDynamicCast(IOPCIDevice, provider);
        if (_device == NULL) 
		{
            return kIOReturnBadArgument;
        }
        
        // Disable the master interrupt
        EnableUSBInterrupt(false);

		SetVendorInfo();
		
        SetDeviceName();
        
        // SetVendorInfo() set an errata bit, so we need to OR in our regular errata
        _ERRATA64BITS |= GetErrata64Bits(_vendorID, _deviceID, _revisionID);
		
		if (_v3ExpansionData->_onThunderbolt || (_ERRATA64BITS & kErrataDontUseCompanionController))
		{
			USBLog(3, "AppleUSBUHCI[%p]::UIMInitialize - Thunderbolt and companion controllers disallowed. Not initializing", this);
            return kIOReturnUnsupported;
		}
		
        _ioMap = _device->mapDeviceMemoryWithIndex(0);
		
        USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize - _ioMap = %p", this, _ioMap);
        if (_ioMap) 
		{
            USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize - _ioMap vaddr %p, pPhysical %p", this, (void*)_ioMap->getVirtualAddress(), (void*)_ioMap->getPhysicalAddress());
        } else 
		{
            USBError(1, "AppleUSBUHCI::UIMInitialize - ioMap is NULL");
            return kIOReturnNoMemory;
        }

		_ioPhysAddress = _ioMap->getPhysicalAddress();
        _ioVirtAddress = _ioMap->getVirtualAddress();
        
		USBLog(3, "AppleUSBUHCI[%p]::UIMInitialize config @ %x (%x)", this, (uint32_t)_ioVirtAddress, (uint32_t)_ioPhysAddress);
		
        _frameLock = IOLockAlloc();
        if (_frameLock == NULL) 
		{
            return kIOReturnNoMemory;
        }

        _isocBandwidth = kUSBMaxFSIsocEndpointReqCount;
		_expansionData->_isochMaxBusStall = kUHCIIsochMaxBusStall;						// we need a requireMaxBusStall of 10 microseconds for UHCI
		
		
		tempTime = mach_absolute_time();
		_lastTime = *(AbsoluteTime*)&tempTime;
       
		USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize - there are %d interrupt sources", this, _numInterruptSources);
        
        //_interruptSource = IOInterruptEventSource::interruptEventSource(this, &InterruptHandler, _device);
        
        _interruptSource = IOFilterInterruptEventSource::filterInterruptEventSource(this, &InterruptHandler, &PrimaryInterruptFilter, _device);
        
        if (!_interruptSource || (_workLoop->addEventSource(_interruptSource) != kIOReturnSuccess)) 
		{
            return kIOReturnBadArgument;
        }
        
        USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize - Getting config registers:", this);
        USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize -   CLASSC: %08x", this, (unsigned int)_device->configRead32(0x08));
        USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize -   USBBASE: %08x", this, (unsigned int)_device->configRead32(0x20));
        USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize -   SBRN: %02x", this, _device->configRead8(0x60));
        
        // leave bus mastering off until the setPowerState
        _device->configWrite16(kIOPCIConfigCommand, kIOPCICommandMemorySpace | kIOPCICommandIOSpace);
        
        USBLog(7, "AppleUSBUHCI[%p]::UIMInitialize - calling HardwareInit:", this);
        
